Revit 2027 API
RailTypeDefaultJoinOption Enumeration
 The default join type of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailTypeDefaultJoinOption
Public Enumeration RailTypeDefaultJoinOption
public enum class RailTypeDefaultJoinOption
type RailTypeDefaultJoinOption
Members
Member name | Value | Description
Fillet | 1 |  The rails will be joined by a fillet connection.
Miter | 0 |  The rails will be joined by a miter connection.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace